In [1]:
import pandas as pd

mydataset={
    'car':["Ford", "BMW", "Hyundai"],
    'passing':[3, 4,5]
}
mycar= pd.DataFrame(mydataset)
print(mycar)

       car  passing
0     Ford        3
1      BMW        4
2  Hyundai        5

## Creating a Dataset

In [2]:
import pandas as pd

newdataset={
    'dog':["Munmun", "Floppy", "jimmy"],
    'friends':["Simona", "Smriti", "Kriti"]
}
dataset=pd.DataFrame(newdataset)
print(dataset)

      dog friends
0  Munmun  Simona
1  Floppy  Smriti
2   jimmy   Kriti

In [3]:
import pandas as pd

newdataset={
    'country':["America", "France", "Italy", "Switzerland", "Greece", "Vietnam"],
    'Color':["Red", "Green", "Pink", "Yellow", "Blue", "Sage Green"],
    'City':["Newyork", "Chicago", "Nashville", "Colorado", "Florida", "Los Angeles"]

}
df=pd.DataFrame(newdataset)
df.to_csv("data_newnew.csv", index=False)
print("CSV file created successfully")

CSV file created successfully

In [4]:
import pandas as pd
print(pd.__version__)

2.1.4

In [5]:
import pandas as pd
a=[1,3,4,-6]
myvar=pd.Series(a)
print(myvar)

0    1
1    3
2    4
3   -6
dtype: int64

In [6]:
import pandas as pd
a=[0,1,1,0,1,1]
mylist=pd.Series(a)
print(mylist)

0    0
1    1
2    1
3    0
4    1
5    1
dtype: int64

In [7]:
data=[10,20,30,40,50,60,70,80]
s=pd.Series(data, index=["a", "b", "c", "d", "e", "f", "g", "h"])
print(s)

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
dtype: int64

In [8]:
data=[2,3,45,6,7,8,9]
s=pd.Series(data, index=["s", "h", "a", "b", "n", "a", "m"])
print(s)

s     2
h     3
a    45
b     6
n     7
a     8
m     9
dtype: int64

In [9]:
import pandas as pd
data={
    "calories":[430, 230, 444, 111],
    "duration":[50,88,99,100]
}
df=pd.DataFrame(data)
print(df)
df.shape
df.info()

   calories  duration
0       430        50
1       230        88
2       444        99
3       111       100
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  4 non-null      int64
 1   duration  4 non-null      int64
dtypes: int64(2)
memory usage: 196.0 bytes

In [10]:
import pandas as pd

data=["Newyork", "Colorado", "Kansas", "Florida", "California"]
cities=pd.Series(data, index=[1,2,3,4,5])
print(cities)

1       Newyork
2      Colorado
3        Kansas
4       Florida
5    California
dtype: object

In [13]:
import pandas as pd
dataset= {
    'City':["Newyork", "Colorado", "Florida"],
    'color':["Red", "Pink", "Green"]
}
df=pd.DataFrame(dataset)
print(df)
df.shape

       City  color
0   Newyork    Red
1  Colorado   Pink
2   Florida  Green

(3, 2)

In [ ]:
import pandas as pd
df=pd.read_csv("csv_data/data.csv")
print(df)

In [ ]:
import pandas as pd
df=pd.read_csv(r"C:\Users\shabn\Downloads\data.csv")
print(df)

In [14]:
import pandas as pd
df=pd.read_csv("csv_data/data.csv", usecols=["Age", "Color"])
print(df)

   Age    Color
0   21      Red
1   22     Pink
2   28    Black
3   35   Orange
4   23    Brown

In [25]:
import pandas as pd
df=pd.read_csv("csv_data/student.csv, index_col="Name")
print(df)

SyntaxError: unterminated string literal (detected at line 2) (2046862441.py, line 2)

In [ ]:
#reading liminted rows
import pandas as pd
df=pd.read_csv(r"C:\Users\shabn\Downloads\data.csv", nrows=3)
print(df)

In [ ]:
import pandas as pd
df=pd.read_csv(r"C:\Users\shabn\Downloads\data.csv", usecols=["Color"])
print(df)

In [ ]:
import pandas as pd
df=pd.read_csv(r"C:\Users\shabn\Downloads\data.csv", skiprows=1)
print(df)

In [16]:
#handling missing values:
import pandas as pd
df=pd.read_csv("csv_data/data.csv", na_values=["NA", ",Missing"])

print(df)

      Name  Age         City    Color
0  Shabnam   21     New York      Red
1    Jimmy   22  Los Angeles     Pink
2   Munmun   28      Chicago    Black
3   Floppy   35      Houston   Orange
4   Coffee   23      Memphis    Brown

In [17]:
import pandas as pd
df=pd.read_csv("csv_data/data.csv")
print(df)

      Name  Age         City    Color
0  Shabnam   21     New York      Red
1    Jimmy   22  Los Angeles     Pink
2   Munmun   28      Chicago    Black
3   Floppy   35      Houston   Orange
4   Coffee   23      Memphis    Brown

In [19]:
import pandas as pd
df=pd.read_csv("csv_data/student.csv")
df['total'] = df['Math'] + df['Science'] + df['English']
print(df)

      Name  Math  Science  English  total
0    Alice    85       90       78    253
1      Bob    76       85       88    249
2  Charlie    90       92       95    277
3    David    65       70       60    195
4      Eve    88       80       85    253

In [20]:
import pandas as pd
df=pd.read_csv("csv_data/student.csv")
df['Total']=df[['Math', 'Science', 'English']].sum(axis=1)
df['Average']=df['Total']/3
print(df)

      Name  Math  Science  English  Total    Average
0    Alice    85       90       78    253  84.333333
1      Bob    76       85       88    249  83.000000
2  Charlie    90       92       95    277  92.333333
3    David    65       70       60    195  65.000000
4      Eve    88       80       85    253  84.333333

In [23]:
import pandas as pd
df=pd.read_csv("csv_data/student.csv")
df['Total']=df[['Math', 'Science', 'English']].sum(axis=1)
df['Average']=df['Total']/3
top_students=df.nlargest(2,'Total')
print(top_students)

      Name  Math  Science  English  Total    Average
2  Charlie    90       92       95    277  92.333333
0    Alice    85       90       78    253  84.333333

In [24]:
import pandas as pd
df=pd.read_csv("csv_data/student.csv")
df['Total']=df['Math'] + df['Science'] + df['English']
print(df)

      Name  Math  Science  English  Total
0    Alice    85       90       78    253
1      Bob    76       85       88    249
2  Charlie    90       92       95    277
3    David    65       70       60    195
4      Eve    88       80       85    253

In [32]:
import pandas as pd
dataset= {
    'Name': ["Shabnam", "Munmun", "Jimmy", "Floppy"],
    'Math':[99,98, 85, 100],
    'English':[100, 90, 90, 89],
    'Social':[89, 88, 90, 70]
}
df=pd.DataFrame(dataset)

print(df[["Name", "Math", "English"]])

      Name  Math  English
0  Shabnam    99      100
1   Munmun    98       90
2    Jimmy    85       90
3   Floppy   100       89

In [84]:
df=pd.DataFrame(dataset)
df['Total']=df['Math'] + df['English'] + df['Social']
df['Average']= df['Total']/3
print(df)
df_sorted= df.sort_values(by="Total", ascending=False)
print(df_sorted)

      Name  Math  English  Social  Total    Average
0  Shabnam    99      100      89    288  96.000000
1   Munmun    98       90      88    276  92.000000
2    Jimmy    85       90      90    265  88.333333
3   Floppy   100       89      70    259  86.333333
      Name  Math  English  Social  Total    Average
0  Shabnam    99      100      89    288  96.000000
1   Munmun    98       90      88    276  92.000000
2    Jimmy    85       90      90    265  88.333333
3   Floppy   100       89      70    259  86.333333

In [37]:
df=pd.DataFrame(dataset)
top_student=df.loc[df["English"].idxmax()]
print(top_student)

Name       Shabnam
Math            99
English        100
Social          89
Name: 0, dtype: object

In [75]:
import pandas as pd
data=pd.read_csv("csv_data/student.csv")
print(data)

      Name  Math  Science  English
0    Alice    85       90       78
1      Bob    76       85       88
2  Charlie    90       92       95
3    David    65       70       60
4      Eve    88       80       85

data.tail(1)

In [63]:
data.shape
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Math     5 non-null      int64
 2   Science  5 non-null      int64
 3   English  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [74]:
df=pd.read_csv("csv_data/student.csv")
min_score=df['Math'].min()
print(min_score)

65

In [86]:
df=pd.read_csv("csv_data/student.csv")
df['total']=df['Math'] + df['Science'] + df['English']
df['Average']=df['total'] /3
print(df)

      Name  Math  Science  English  total    Average
0    Alice    85       90       78    253  84.333333
1      Bob    76       85       88    249  83.000000
2  Charlie    90       92       95    277  92.333333
3    David    65       70       60    195  65.000000
4      Eve    88       80       85    253  84.333333

In [95]:
df=pd.read_csv("csv_data/student.csv")
high_science=df[df["Science"]>80]
print(high_science)

      Name  Math  Science  English
0    Alice    85       90       78
1      Bob    76       85       88
2  Charlie    90       92       95

In [96]:
df=pd.read_csv("csv_data/student.csv")
high_english=df[df["English"]>85]
print(high_english)

      Name  Math  Science  English
1      Bob    76       85       88
2  Charlie    90       92       95

In [98]:
df=pd.read_csv("csv_data/student.csv")
df=df.rename(columns={"Math":"Mathematics", "English":"Eng"})
print(df)

      Name  Mathematics  Science  Eng
0    Alice           85       90   78
1      Bob           76       85   88
2  Charlie           90       92   95
3    David           65       70   60
4      Eve           88       80   85

In [99]:
df=pd.read_csv("csv_data/student.csv")
print(df.tail(2))

    Name  Math  Science  English
3  David    65       70       60
4    Eve    88       80       85

In [101]:
print(df.head(3))

      Name  Math  Science  English
0    Alice    85       90       78
1      Bob    76       85       88
2  Charlie    90       92       95

In [106]:
df=df.loc[df["Math"].idxmax()]
print(df)

Name       Charlie
Math            90
Science         92
English         95
Name: 2, dtype: object

In [ ]:
df=pd.read_csv("csv_data/student.csv")
df['Total']=df['Math'] + df['English'] +df["Science"]
df['average']= df['Total']/3
print(df)

## Using Mean to calculate Average

In [111]:
subject_average= df[["Math", "Science", "English"]].mean()
print(subject_average)

Math       80.8
Science    83.4
English    81.2
dtype: float64

## Filtering Female Students from the dataset. When there is no "gender" colum, the error shows.

In [119]:
df=pd.read_csv("csv_data/info.csv")
female=df[df["gender"]== "F"]
print(female)

KeyError: 'gender'

## Sorting list in Descending order

In [121]:
import pandas as pd
df=pd.read_csv("csv_data/student.csv")
print(df)

      Name  Math  Science  English
0    Alice    85       90       78
1      Bob    76       85       88
2  Charlie    90       92       95
3    David    65       70       60
4      Eve    88       80       85

In [124]:
df['Total']=df['Math'] + df['Science'] +df['English']
df_sorted=df.sort_values(by="Total",ascending=False)
print(df_sorted)

      Name  Math  Science  English  Total
2  Charlie    90       92       95    277
0    Alice    85       90       78    253
4      Eve    88       80       85    253
1      Bob    76       85       88    249
3    David    65       70       60    195

In [129]:
count=df[df['English']>85]
print(count)

      Name  Math  Science  English  Total
1      Bob    76       85       88    249
2  Charlie    90       92       95    277

In [133]:
df=df.rename(columns={"Math":"Mathematics", "English":"Eng", "Total":"Tot"})
print(df)

      Name  Mathematics  Science  Eng  Tot
0    Alice           85       90   78  253
1      Bob           76       85   88  249
2  Charlie           90       92   95  277
3    David           65       70   60  195
4      Eve           88       80   85  253

In [145]:
print(df.columns)

Index(['Name', 'Mathematics', 'Science', 'Tot'], dtype='object')

## Droping the columns

In [149]:
df=df.drop(columns=["Mathematics"])
print(df)

      Name  Science  Tot
0    Alice       90  253
1      Bob       85  249
2  Charlie       92  277
3    David       70  195
4      Eve       80  253

In [156]:
df=pd.read_csv("csv_data/student.csv")
df.head(2)

    Name  Math  Science  English
0  Alice    85       90       78
1    Bob    76       85       88

## loading the titanic Dataset

In [171]:
import pandas as pd
df=pd.read_csv("csv_data/tested.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [174]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [163]:
df.tail(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
411,1303,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
412,1304,1,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,NaN,S
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [165]:
df.shape

(418, 12)

In [176]:
df.head(450)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

## Counting the columns

In [166]:
df.columns.nunique()

12

In [167]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [169]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

## total number of null vaues present in the dataset

In [173]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

## showing all the datasets using Display.max_columns

In [ ]:
import pandas as pd

# Load CSV
df = pd.read_csv("csv_data/tested.csv")

# Show all rows
pd.set_option("display.max_rows", None)

# Show all columns
pd.set_option("display.max_columns", None)

# Print full DataFrame
print(df)